# NumberOfVertices Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarShapeDefinitionBySegments..::..NumberOfVertices Property
RebarShapeDefinitionBySegments Class See Also
---
The number of vertices in this shape, always equal to NumberOfSegments + 1.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public int NumberOfVertices { get; }
```

Visual Basic
---
```text
Public ReadOnly Property NumberOfVertices As Integer
	Get
```

Visual C++
---
```text
public:
property int NumberOfVertices {
	int get ();
}
```

# See Also
RebarShapeDefinitionBySegments Class
Autodesk.Revit.DB.Structure Namespace